;; -*- no-byte-compile: t; lexical-binding: t; -*-
;;; ~/.config/doom/packages.el
(package! evil-terminal-cursor-changer)
(package! lsp-mode)
(package! company-lsp)
(package! ccls)
(package! lsp-ui)
(package! flycheck)
(package! yasnippet)
(package! evil-snipe :disable t)
(package! telephone-line)
;; (package! powerline-evil)
;; (package! flycheck-clang-tidy)
;; (package! helm-rg)
(package! undo-tree :recipe (:fetcher git :url "http://www.dr-qubit.org/git/undo-tree.git/"))
(package! d-mode)
(package! solaire-mode :recipe (:fetcher github :repo "yshui/emacs-solaire-mode"))
(package! meson-mode)
(package! racer :disable t)
(package! xclip)
