;; -*- no-byte-compile: t; -*-
;;; ~/.config/doom/packages.el
(package! evil-terminal-cursor-changer)
(package! lsp-mode)
(package! company-lsp)
(package! ccls)
(package! lsp-ui)
(package! flycheck)
(package! yasnippet)
(package! evil-snipe :disable t)
(package! powerline)
;; (package! spaceline)
(package! telephone-line)
(package! airline-themes)
;; (package! powerline-evil)
;; (package! flycheck-clang-tidy)
;; (package! helm-rg)
